리액트 뷰 둘다 최근 인기 있는 프론트엔드 라이브러리, 프레임워크이다.

둘다 spa 기반의 웹 프론트엔드를 지원한다.

그래서 두개의 차이 장단점 등등을 여러 블로그에서 찾아 보도록 할것이다.

한 블로그에서는 react를 vue 보다 선호하는데 그 이유 세가지는

1.타입스크립트 지원 2. 단순한 컴포넌트 정의의 용의함 3. 더 빠르고 담대한 개선 이라고한다.

타입스크립트 지원은 react가 아주 매끄럽게 결합되어있다고한다.
큰 보일러프레이트 없이도 SFC와 클래스 기반 컴포넌트 둘 모두의 타입을 정확하게
기술 할 수 있고, redux를 비롯한 컴페니언 툴도 대부분 훌륭한 타입 지원을 제공한다고한다.

반면 vue는 TS지원의 큰 개선을 홍보했지만 아직 많이 미흡하다고 한다.


단순 컴포넌트 정의의 용이함은 

무상태 함수 컴포넌트 등의 함수 예를 들며 설명하고 있다.
코드가 아주 명백하다고 한다.
컴포넌트를 잘게 쪼갤 때 React는 Vue에 비해 다음 강점을 갖는다.
 - 작은 컴포넌트를 정의하는 문법이 직관적이고 간결
 - 컴포넌트를 정의하는 두 문법(SFC, 클래스 기반 컴포넌트)이 상대적으로 더 일관적이다.
 - 템플릿을 문자열로 표현하지 않으므로 여러 정보를 잃어버리지 않는다.
 
그리고 지금까지의 변화를 봤을 때 더 빠르고 담대하게 변화하는게 React였고 앞으로도
그럴 것 같다고 설명하고 있다.

마지막으로 두 라이브러리라 추구하는 바에 대한 자신의 인상에 대해 설명 하고 있다.

  - React는 Vue.js보다 매직이 덜하다. Vue는 사용자에게 쉽게 느껴지는 API를 제공하기 위해 라이브러리가 직접
  헤비 리프팅을 하는 경우가 많다.
  - React는 Vue.js에 플레인 자바스크립트에 가깝다. 새로운 문법 내지는 컨벤션을 정의하는 대신
  자바스크립트의 그것을 활용하는데 무리가 없다면 그리한다.
  - React는 Vue.js에 비해 사용자 및 사용처에 대해 더 적은 가정을 하고, 컴포넌트 기반의
  선언적 UI 렌더링이라는 가장 핵심적인 기능과 관련된 부분만 코어에 포함한다.
 
 ---------------------------------------------------------------------
 ReactJS의 장점과 단점
 
 ReactJS는 2013년에 페이스북으로부터 개발된 오픈 소스 javascript 라이브러리이다.
 ReactJS는 정기적으로 데이터가 변경될 수 있는 거대한 웹 애플리케이션을 구축하는데 유용
 
 
 ReactJS의 장점
 
 - 배우기 쉽다. 구문이 간편하다.
 - 높은 수준의 유연성과 최대의 응답성
 - 웹 앱의 여러 요소들을 파싱하는 동안 HTML, XHTML 또는 XML 포멧의 문서를 웹 브라우저가 접근하기
 좋은 트리 형태로 배열할 수 있게 해주는 가상 DOM(문서 객체 모델)
 - ES6/7과 결합된 ReactJS는 쉬운 방법으로 고부하 작업을 쉽게 처리 할 수 있다.
 - 하위 데이터 바인딩, 이런 종류의 데이터 흐름을 사용하는 것은 하위 요소가 상위 데이터에 영향을 미칠수 없다.
 - 100% 오픈 소스 JavsScript 라이브러리이므로 전  세계 개발자의 기여에 따라 일상적인 업데이트 및 개선 사항이 있다.
 - 유저사이드에서 수행하는 데이터를 서버사이드에서 동시에 쉽게 나타낼 수 있기 때문에 절대적으로 가볍다.
 - Facebook이 프로세스의 대부분을 자동화하는 codemods 제공하기 때문에 일반적으로 버전 간의 마이그레이션이 매우 쉽다.
 
 
 단점
  - 공식 문서 부족, ReactJs의 초고속 개발 때문에 적절한 문서를 작성하지 않았고 많은 개발자들이 계속해서 체계적인 접근 없이 개별적으로 기여하느라 조금 혼란
  - 자유도가 높다. 선택의 폭이 매우 넓다.
  - mvc 프레임워크 사용자 인터페이스를 통합하는 방법에 대한 깊은 지식을 필요로 함.
  
 
 Vue.js의 장점
 
 - 권한이 부여된 HTML, 
 - 자세한 문서, 개발자들을 위해 빠른 러닝 커브를 가질 수 있도록 하고, HTML, JavaScript의 기본 지식만을 사용하여
 앱을 개발하는데 많은 시간을 절약할 수 있도록 하는 매우 적절한 문서를 제공
 - 적응성, 디자인과 아키텍쳐 측면에서 angular와 react와 유사하기 때문에 다른 프레임워크에서 vue.js로 빠르게 스위칭할 수 있다.
 - 훌륭한 통합, Vue.js는 SPA와 그보다 더 복자합 웹 인터페이스를 가진 앱을 구축하는데 모두 사용 될 수 있다.
 중요한 것은 인터렉티브 부분이 작아 전체 시스템에 부정적인 영향이 없이 기존의 인프라와 쉽게 통합 할수 있다는 것.
 - 대규모 확장, Vue.js는 간단한 구조는 추가적인 시간 투자 없이 만들 수 있는 꽤 큰 재사용 가능한
 템플릿을 개발하는데 돔우이 될 수 있다.
 - 작은 크기, vue.js는 속도와 유연성을 유지하면서 약 20kb의 용량을 유지할 수 있다.
 이는 다른 프레임워크와 비교하여 훨씬 더 훌륭한 성능에 도달 할 수 있도록 해줌.
 
 단점
 - 자원 부족, vue.js는 여전히 React 혹은 Angular와 비교하여 꽤 작은 시장 점유율을 가지고 있다.
 프레임워크에서 지식 공유가 여전히 시작 단계에 머물러 있음을 의미.
 - 과도한 유연성의 위험. 때때로 Vue.js는 거대한 프로젝트에 통합할 때 이슈가 있을 수 있고, 여전히 가능한
 솔루션에 대한 경험이 없습니다. 하지만 이는 곧 제공될 예정
 - 영어 문서의 부족, 이 때문에 개발의 일부 단계에서 부분적으로 복잡할 수 있지만 점점 더 많은 문서들이 영어로 변경되고 있다.
  
 
